transonic-bump/setups.orig/common/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/freestreamConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pinlet;


boundaryField
{
    inlet
    {
        type            zeroGradient;
    }


    outlet
    {
        type            fixedValue;
        value           $internalField;
    }



    top
    {
        type            symmetry;
    }

    obstacle
    {
        type            zeroGradient;
    }


    upwall
    {
        type            symmetry;
    }

    downwall
    {
        type            symmetry;
    }








    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
