transonic-bump/setups.orig/common/0.orig/Ret
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ret;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 0 0 0 0];

internalField   uniform 30.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 800;
    }
    outlet
    {
	type zeroGradient;
    }
      
    top
    {
        type            symmetry;
    }
    obstacle
    {
        type            zeroGradient;
    }

    upwall
    {
        type            symmetry;
    }

    downwall
    {
        type            symmetry;
    }


    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
