transonic-bump/setups.orig/common/0.orig/phit
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      phit;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0 ];

internalField   uniform 0.66;

boundaryField
{
    inlet
    {
        type            zeroGradient;


    }

    outlet
    {
        type zeroGradient;
    }

    top
    {
        type symmetry;
    }
    obstacle
    {
        type            fixedValue;
        value           uniform 1e-10;

    }

    upwall
    {
        type            symmetry;
    }

    downwall
    {
        type            symmetry;
    }



    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
